<?php
require_once 'common.php';
C('pageid', 'math');
C('webtitle', '高中数学公式');
include_once 'head.php';
?>
    <div class="row">
        <div class="col-lg-8 col-sm-10 col-xs-12 center-block" role="main">
            <div class="panel panel-primary">
                <div class="panel-heading w h">
                    <h3 class="panel-title" align="center">高中数学必备公式</h3>
                </div>
乘法与因式分解 
 <br>
a^2-b^2=(a+b)(a-b) 
 <br>
a^3+b^3=(a+b)(a^2-ab+b^2)   
<br>
a^3-b^3=(a-b(a^2+ab+b^2)  
<br>
三角不等式 |a+b|≤|a|+|b| |a-b|≤|a|+|b| |a|≤b<=>-b≤a≤b  
<br>
|a-b|≥|a|-|b| -|a|≤a≤|a|  
<br>
一元二次方程的解 -b+√(b^2-4ac)/2a -b-√(b^2-4ac)/2a  
<br>
根与系数的关系 X1+X2=-b/a X1*X2=c/a 注：韦达定理
  <br>
判别式  
<br>
b^2-4ac=0 注：方程有两个相等的实根  
<br>
b^2-4ac>0 注：方程有两个不等的实根 
  <br>
b^2-4ac<0 注：方程没有实根，有共轭复数根  
<br>
三角函数公式  
<br>
两角和公式  
<br>
sin(A+B)=sinAcosB+cosAsinB  
<br>
sin(A-B)=sinAcosB-sinBcosA  
 <br>
cos(A+B)=cosAcosB-sinAsinB  
<br>
cos(A-B)=cosAcosB+sinAsinB  
<br>
tan(A+B)=(tanA+tanB)/(1-tanAtanB)  
<br>
tan(A-B)=(tanA-tanB)/(1+tanAtanB)  
<br>
cot(A+B)=(cotAcotB-1)/(cotB+cotA) 
  <br>
cot(A-B)=(cotAcotB+1)/(cotB-cotA) 
 <br>
倍角公式
  <br>
tan2A=2tanA/[1-(tanA)^2]  
<br>
cos2a=(cosa)^2-(sina)^2=2(cosa)^2 -1=1-2(sina)^2 
<br>
半角公式  
<br>
sin(A/2)=√((1-cosA)/2) sin(A/2)=-√((1-cosA)/2)  
<br>
cos(A/2)=√((1+cosA)/2) cos(A/2)=-√((1+cosA)/2) 
 <br>
tan(A/2)=√((1-cosA)/((1+cosA)) tan(A/2)=-√((1-cosA)/((1+cosA))  
<br>
cot(A/2)=√((1+cosA)/((1-cosA)) cot(A/2)=-√((1+cosA)/((1-cosA)) 
  <br>
和差化积  
<br>
2sinAcosB=sin(A+B)+sin(A-B) 
 <br>
2cosAsinB=sin(A+B)-sin(A-B) )  
<br>
2cosAcosB=cos(A+B)-sin(A-B) 
 <br>
-2sinAsinB=cos(A+B)-cos(A-B)
  <br>
sinA+sinB=2sin((A+B)/2)cos((A-B)/2  
<br>
cosA+cosB=2cos((A+B)/2)sin((A-B)/2)
  <br>
tanA+tanB=sin(A+B)/cosAcosB 
 <br>

某些数列前n项和 
 <br>
1+2+3+4+5+6+7+8+9+…+n=n(n+1)/2  
<br>
1+3+5+7+9+11+13+15+…+(2n-1)=n2
<br>
2+4+6+8+10+12+14+…+(2n)=n(n+1) 5  
<br>
1^2+2^2+3^2+4^2+5^2+6^2+7^2+8^2+…+n^2=n(n+1)(2n+1)/6  
<br>
1^3+2^3+3^3+4^3+5^3+6^3+…n^3=n2(n+1)2/4  
<br>
1*2+2*3+3*4+4*5+5*6+6*7+…+n(n+1)=n(n+1)(n+2)/3  
<br>
正弦定理 a/sinA=b/sinB=c/sinC=2R 注： 其中 R 表示三角形的外接圆半径 
 <br>
余弦定理 b^2=a^2+c^2-2accosB 注：角B是边a和边c的夹角
  <br>
圆的标准方程 (x-a)^2+(y-b)^2=^r2 注：（a,b）是圆心坐标
<br>
圆的一般方程 x^2+y^2+Dx+Ey+F=0 注：D^2+E^2-4F>0
  <br>
抛物线标准方程 y^2=2px y^2=-2px x^2=2py x^2=-2py  
<br>
直棱柱侧面积 S=c*h 斜棱柱侧面积 S=c'*h  
<br>
正棱锥侧面积 S=1/2c*h' 正棱台侧面积 S=1/2(c+c')h' 
 <br>
圆台侧面积 S=1/2(c+c')l=pi(R+r)l 球的表面积 S=4pi*r2 
 <br>
圆柱侧面积 S=c*h=2pi*h 圆锥侧面积 S=1/2*c*l=pi*r*l 
 <br>
弧长公式 l=a*r a是圆心角的弧度数r >0 扇形面积公式 s=1/2*l*r 
 <br>
锥体体积公式 V=1/3*S*H 圆锥体体积公式 V=1/3*pi*r2h
   <br>
斜棱柱体积 V=S'L 注：其中,S'是直截面面积， L是侧棱长  
<br>
柱体体积公式 V=s*h 圆柱体 V=pi*r2h  
<br>

定理:  
<br>
1 过两点有且只有一条直线  
<br>
2 两点之间线段最短  
<br>
3 同角或等角的补角相等  
<br>
4 同角或等角的余角相等  
<br>
5 过一点有且只有一条直线和已知直线垂直  
<br>
6 直线外一点与直线上各点连接的所有线段中，垂线段最短  
<br>
7 平行公理 经过直线外一点，有且只有一条直线与这条直线平行  
<br>
8 如果两条直线都和第三条直线平行，这两条直线也互相平行  
<br>
9 同位角相等，两直线平行
  <br>
10 内错角相等，两直线平行  
<br>
11 同旁内角互补，两直线平行 
 <br>
 
12两直线平行，同位角相等  
<br>
13 两直线平行，内错角相等  
<br>
14 两直线平行，同旁内角互补 
 <br>
15 定理 三角形两边的和大于第三边 
 <br>
16 推论 三角形两边的差小于第三边 
 <br>
17 三角形内角和定理 三角形三个内角的和等于180° 
 <br>
18 推论1 直角三角形的两个锐角互余  
<br>
19 推论2 三角形的一个外角等于和它不相邻的两个内角的和 
 <br>
20 推论3 三角形的一个外角大于任何一个和它不相邻的内角  
<br>
21 全等三角形的对应边、对应角相等  
<br>
22边角边公理(SAS) 有两边和它们的夹角对应相等的两个三角形全等  
<br>
23 角边角公理( ASA)有两角和它们的夹边对应相等的两个三角形全等  
<br>
24 推论(AAS) 有两角和其中一角的对边对应相等的两个三角形全等  
<br>
25 边边边公理(SSS) 有三边对应相等的两个三角形全等  
<br>
26 斜边、直角边公理(HL) 有斜边和一条直角边对应相等的两个直角三角形全等  
<br>
27 定理1 在角的平分线上的点到这个角的两边的距离相等  
<br>
28 定理2 到一个角的两边的距离相同的点，在这个角的平分线上  
<br>
29 角的平分线是到角的两边距离相等的所有点的集合  
<br>
30 等腰三角形的性质定理 等腰三角形的两个底角相等 (即等边对等角） 
 <br>
31 推论1 等腰三角形顶角的平分线平分底边并且垂直于底边  
<br>
32 等腰三角形的顶角平分线、底边上的中线和底边上的高互相重合 
 <br>
33 推论3 等边三角形的各角都相等，并且每一个角都等于60°  
<br>
34 等腰三角形的判定定理 如果一个三角形有两个角相等，那么这两个角所对的边也相等（等角对等边）
  <br>
35 推论1 三个角都相等的三角形是等边三角形  
<br>
36 推论 2 有一个角等于60°的等腰三角形是等边三角形  
<br>
37 在直角三角形中，如果一个锐角等于30°那么它所对的直角边等于斜边的一半  
<br>
38 直角三角形斜边上的中线等于斜边上的一半  
<br>
39 定理 线段垂直平分线上的点和这条线段两个端点的距离相等   
<br>
40 逆定理 和一条线段两个端点距离相等的点，在这条线段的垂直平分线上
<br>
41 线段的垂直平分线可看作和线段两端点距离相等的所有点的集合 
 <br>
 
42 定理1 关于某条直线对称的两个图形是全等形 
 <br>
43 定理 2 如果两个图形关于某直线对称，那么对称轴是对应点连线的垂直平分线 
 <br>
44定理3 两个图形关于某直线对称，如果它们的对应线段或延长线相交，那么交点在对称轴上 
 <br>
45逆定理 如果两个图形的对应点连线被同一条直线垂直平分，那么这两个图形关于这条直线对称 
 <br>
46勾股定理 直角三角形两直角边a、b的平方和、等于斜边c的平方，即a^2+b^2=c^2 
 <br>
47勾股定理的逆定理 如果三角形的三边长a、b、c有关系a^2+b^2=c^2 ，那么这个三角形是直角三角形  
<br>
48定理 四边形的内角和等于360°  
<br>
49四边形的外角和等于360°  
<br>
50多边形内角和定理 n边形的内角的和等于（n-2）×180° 
 <br>
51推论 任意多边的外角和等于360°  
<br>
52平行四边形性质定理1 平行四边形的对角相等  
<br>
53平行四边形性质定理2 平行四边形的对边相等  
<br>
54推论 夹在两条平行线间的平行线段相等  
<br>
55平行四边形性质定理3 平行四边形的对角线互相平分  
<br>
56平行四边形判定定理1 两组对角分别相等的四边形是平行四边形  
<br>
57平行四边形判定定理2 两组对边分别相等的四边形是平行四边形  
<br>
58平行四边形判定定理3 对角线互相平分的四边形是平行四边形  
<br>
59平行四边形判定定理4 一组对边平行相等的四边形是平行四边形 
 <br>
60矩形性质定理1 矩形的四个角都是直角  
<br>
61矩形性质定理2 矩形的对角线相等  
<br>
62矩形判定定理1 有三个角是直角的四边形是矩形  
<br>
63矩形判定定理2 对角线相等的平行四边形是矩形  
<br>
64菱形性质定理1 菱形的四条边都相等  
<br>
65菱形性质定理2 菱形的对角线互相垂直，并且每一条对角线平分一组对角  
<br>
66菱形面积=对角线乘积的一半，即S=（a×b）÷2 
 <br>
67菱形判定定理1 四边都相等的四边形是菱形  
<br>
68菱形判定定理2 对角线互相垂直的平行四边形是菱形  
<br>
69正方形性质定理1 正方形的四个角都是直角，四条边都相等  
<br>
70正方形性质定理2正方形的两条对角线相等，并且互相垂直平分，每条对角线平分一组对角 
 <br>
71定理1 关于中心对称的两个图形是全等的  
<br>
72定理2 关于中心对称的两个图形，对称点连线都经过对称中心，并且被对称中心平分 
 <br>
73逆定理 如果两个图形的对应点连线都经过某一点，并且被这一 点平分，那么这两个图形关于这一点对称  
<br>
74等腰梯形性质定理 等腰梯形在同一底上的两个角相等  
<br>
75等腰梯形的两条对角线相等 
 <br>
76等腰梯形判定定理 在同一底上的两个角相等的梯形是等腰梯形  
<br>
77对角线相等的梯形是等腰梯形  
<br>

78平行线等分线段定理 如果一组平行线在一条直线上截得的线段  
<br>
相等，那么在其他直线上截得的线段也相等  
<br>
79 推论1 经过梯形一腰的中点与底平行的直线，必平分另一腰  
<br>
80 推论2 经过三角形一边的中点与另一边平行的直线，必平分第 三边  
<br>
81 三角形中位线定理 三角形的中位线平行于第三边，并且等于它 的一半  
<br>
82 梯形中位线定理 梯形的中位线平行于两底，并且等于两底和的 一半 L=（a+b）÷2 S=L×h  
<br>
83 (1)比例的基本性质 如果a:b=c:d,那么ad=bc 
如果ad=bc,那么a:b=c:d wc呁/S∕ ?  
<br>
84 (2)合比性质 如果a／b=c／d,那么(a±b)／b=(c±d)／d  
<br>
85 (3)等比性质 如果a／b=c／d=…=m／n(b+d+…+n≠0),那么 
(a+c+…+m)／(b+d+…+n)=a／b  
<br>
86 平行线分线段成比例定理 三条平行线截两条直线，所得的对应 线段成比例 
 <br>
87 推论 平行于三角形一边的直线截其他两边（或两边的延长线），所得的对应线段成比例 
 <br>
88 定理 如果一条直线截三角形的两边（或两边的延长线）所得的对应线段成比例，那么这条直线平行于三角形的第三边  
<br>
89 平行于三角形的一边，并且和其他两边相交的直线，所截得的三角形的三边与原三角形三边对应成比例  
<br>
90 定理 平行于三角形一边的直线和其他两边（或两边的延长线）相交，所构成的三角形与原三角形相似 
 <br>
91 相似三角形判定定理1 两角对应相等，两三角形相似（ASA）  
<br>
92 直角三角形被斜边上的高分成的两个直角三角形和原三角形相似 
 <br>
93 判定定理2 两边对应成比例且夹角相等，两三角形相似（SAS）
  <br>
94 判定定理3 三边对应成比例，两三角形相似（SSS）  
<br>
95 定理 如果一个直角三角形的斜边和一条直角边与另一个直角三 角形的斜边和一条直角边对应成比例，那么这两个直角三角形相似  
<br>
96 性质定理1 相似三角形对应高的比，对应中线的比与对应角平 分线的比都等于相似比  
<br>
97 性质定理2 相似三角形周长的比等于相似比  
<br>
98 性质定理3 相似三角形面积的比等于相似比的平方  
<br>
99 任意锐角的正弦值等于它的余角的余弦值，任意锐角的余弦值等 于它的余角的正弦值
  <br>
100任意锐角的正切值等于它的余角的余切值，任意锐角的余切值等 于它的余角的正切值  
<br>
101圆是定点的距离等于定长的点的集合  
<br>
102圆的内部可以看作是圆心的距离小于半径的点的集合 
 <br>
103圆的外部可以看作是圆心的距离大于半径的点的集合  
<br>
104同圆或等圆的半径相等  
<br>
105到定点的距离等于定长的点的轨迹，是以定点为圆心，定长为半 径的圆  
<br>
106和已知线段两个端点的距离相等的点的轨迹，是着条线段的垂直 平分线  
<br>
107到已知角的两边距离相等的点的轨迹，是这个角的平分线 
 <br>
108到两条平行线距离相等的点的轨迹，是和这两条平行线平行且距 离相等的一条直线  
<br>
109定理 不在同一直线上的三点确定一个圆。  
<br>
110垂径定理 垂直于弦的直径平分这条弦并且平分弦所对的两条弧 
 <br>
111推论1 ①平分弦（不是直径）的直径垂直于弦，并且平分弦所对的两条弧 

②弦的垂直平分线经过圆心，并且平分弦所对的两条弧

③平分弦所对的一条弧的直径，垂直平分弦，并且平分弦所对的另一条弧 
 <br>
112推论2 圆的两条平行弦所夹的弧相等  
<br>
113圆是以圆心为对称中心的中心对称图形  
<br>
114定理 在同圆或等圆中，相等的圆心角所对的弧相等，所对的弦 相等，所对的弦的弦心距相等  
<br>
115推论 在同圆或等圆中，如果两个圆心角、两条弧、两条弦或两 弦的弦心距中有一组量相等那么它们所对应的其余各组量都相等  
<br>
116定理 一条弧所对的圆周角等于它所对的圆心角的一半  
<br>
117推论1 同弧或等弧所对的圆周角相等；同圆或等圆中，相等的圆周角所对的弧也相等  
<br>
118推论2 半圆（或直径）所对的圆周角是直角；90°的圆周角所 对的弦是直径  
<br>
119推论3 如果三角形一边上的中线等于这边的一半，那么这个三角形是直角三角形  
<br>
120定理 圆的内接四边形的对角互补，并且任何一个外角都等于它 的内对角  
<br>

121①直线L和⊙O相交 d＜r  
②直线L和⊙O相切 d=r  
③直线L和⊙O相离 d＞r
<br>
            </div>
            <div class="clearfix"></div>
        </div>
<?php
include_once 'foot.php';
?>